GraduationP/Embedded-Systems/stm32f103c8t6/stm32f103_can_bootloader/Core/Startup/startup_stm32f103c8tx.c
/*
 * startup_stm32f103c8tx.c
 *
 *  Created on: Mar 3, 2024
 *      Author: wegz
 */

#include "stdint.h"
#include "system_stm32f1xx.h"
#include "stm32f1xx.h"


/* start address for the initialization values of the .data section.
defined in linker script */
extern uint32_t _sidata;
/* start address for the .data section. defined in linker script */
extern uint32_t _sdata;
/* end address for the .data section. defined in linker script */
extern uint32_t _edata;
/* start address for the .bss section. defined in linker script */
extern uint32_t _sbss;
/* end address for the .bss section. defined in linker script */
extern uint32_t _ebss;
extern uint32_t _estack;


extern void __libc_init_array();
extern int main();
#define program_adress 0x08001C00
void Reset_Handler()
{
	uint32_t *dataInit = &_sidata;
	uint32_t *data = &_sdata;
	while(data < &_edata)
		*data++ = *dataInit++;
	uint32_t *bss = &_sbss ;
	while(bss < &_ebss)
		*bss++ = 0;


	SystemInit();	//	SCB->VTOR = VECT_TAB_BASE_ADDRESS | VECT_TAB_OFFSET; /* Vector Table Relocation in Internal SRAM. */
	__libc_init_array();
	main();

	while(1);
}

void Default_Handler()
{
	while(1);
}



__weak void NMI_Handler ()      {Default_Handler();}
__weak void HardFault_Handler ()      {Default_Handler();}
__weak void MemManage_Handler ()      {Default_Handler();}
__weak void BusFault_Handler ()     {Default_Handler();}
__weak void UsageFault_Handler ()     {Default_Handler();}
__weak void SVC_Handler ()      {Default_Handler();}
__weak void DebugMon_Handler ()     {Default_Handler();}
__weak void PendSV_Handler ()    {Default_Handler();}
__weak void SysTick_Handler ()      {Default_Handler();}
__weak void WWDG_IRQHandler ()      {Default_Handler();}
__weak void PVD_IRQHandler ()     {Default_Handler();}
__weak void TAMPER_IRQHandler ()      {Default_Handler();}
__weak void RTC_IRQHandler ()     {Default_Handler();}
__weak void FLASH_IRQHandler ()     {Default_Handler();}
__weak void RCC_IRQHandler ()     {Default_Handler();}
__weak void EXTI0_IRQHandler ()     {Default_Handler();}
__weak void EXTI1_IRQHandler ()     {Default_Handler();}
__weak void EXTI2_IRQHandler ()     {Default_Handler();}
__weak void EXTI3_IRQHandler ()     {Default_Handler();}
__weak void EXTI4_IRQHandler ()    {Default_Handler();}
__weak void DMA1_Channel1_IRQHandler ()     {Default_Handler();}
__weak void DMA1_Channel2_IRQHandler ()     {Default_Handler();}
__weak void DMA1_Channel3_IRQHandler ()    {Default_Handler();}
__weak void DMA1_Channel4_IRQHandler ()    {Default_Handler();}
__weak void DMA1_Channel5_IRQHandler ()     {Default_Handler();}
__weak void DMA1_Channel6_IRQHandler ()     {Default_Handler();}
__weak void DMA1_Channel7_IRQHandler ()    {Default_Handler();}
__weak void ADC1_2_IRQHandler ()      {Default_Handler();}
__weak void USB_HP_CAN1_TX_IRQHandler ()      {Default_Handler();}
__weak void USB_LP_CAN1_RX0_IRQHandler ()     {Default_Handler();}
__weak void CAN1_RX1_IRQHandler ()      {Default_Handler();}
__weak void CAN1_SCE_IRQHandler ()      {Default_Handler();}
__weak void EXTI9_5_IRQHandler ()     {Default_Handler();}
__weak void TIM1_BRK_IRQHandler ()      {Default_Handler();}
__weak void TIM1_UP_IRQHandler ()     {Default_Handler();}
__weak void TIM1_TRG_COM_IRQHandler ()      {Default_Handler();}
__weak void TIM1_CC_IRQHandler ()     {Default_Handler();}
__weak void TIM2_IRQHandler ()    {Default_Handler();}
__weak void TIM3_IRQHandler ()      {Default_Handler();}
__weak void TIM4_IRQHandler ()     {Default_Handler();}
__weak void I2C1_EV_IRQHandler ()     {Default_Handler();}
__weak void I2C1_ER_IRQHandler ()     {Default_Handler();}
__weak void I2C2_EV_IRQHandler ()     {Default_Handler();}
__weak void I2C2_ER_IRQHandler ()    {Default_Handler();}
__weak void SPI1_IRQHandler ()     {Default_Handler();}
__weak void SPI2_IRQHandler ()      {Default_Handler();}
__weak void USART1_IRQHandler ()      {Default_Handler();}
__weak void USART2_IRQHandler ()      {Default_Handler();}
__weak void USART3_IRQHandler ()     {Default_Handler();}
__weak void EXTI15_10_IRQHandler ()     {Default_Handler();}
__weak void RTC_Alarm_IRQHandler ()     {Default_Handler();}
__weak void USBWakeUp_IRQHandler ()     {Default_Handler();}
__weak void BootRAM    ()    {Default_Handler();}


__attribute__((section(".isr_vector")))
const void (*VectorTable[])(void)=
{
		(const void (*)(void))&_estack,
		Reset_Handler,
		NMI_Handler,
		HardFault_Handler,
		MemManage_Handler,
		BusFault_Handler,
		UsageFault_Handler,
		0,
		0,
		0,
		0,
		SVC_Handler,
		DebugMon_Handler,
		0,
		PendSV_Handler,
		SysTick_Handler,
		WWDG_IRQHandler,
		PVD_IRQHandler,
		TAMPER_IRQHandler,
		RTC_IRQHandler,
		FLASH_IRQHandler,
		RCC_IRQHandler,
		EXTI0_IRQHandler,
		EXTI1_IRQHandler,
		EXTI2_IRQHandler,
		EXTI3_IRQHandler,
		EXTI4_IRQHandler,
		DMA1_Channel1_IRQHandler,
		DMA1_Channel2_IRQHandler,
		DMA1_Channel3_IRQHandler,
		DMA1_Channel4_IRQHandler,
		DMA1_Channel5_IRQHandler,
		DMA1_Channel6_IRQHandler,
		DMA1_Channel7_IRQHandler,
		ADC1_2_IRQHandler,
		USB_HP_CAN1_TX_IRQHandler,
		USB_LP_CAN1_RX0_IRQHandler,
		CAN1_RX1_IRQHandler,
		CAN1_SCE_IRQHandler,
		EXTI9_5_IRQHandler,
		TIM1_BRK_IRQHandler,
		TIM1_UP_IRQHandler,
		TIM1_TRG_COM_IRQHandler,
		TIM1_CC_IRQHandler,
		TIM2_IRQHandler,
		TIM3_IRQHandler,
		TIM4_IRQHandler,
		I2C1_EV_IRQHandler,
		I2C1_ER_IRQHandler,
		I2C2_EV_IRQHandler,
		I2C2_ER_IRQHandler,
		SPI1_IRQHandler,
		SPI2_IRQHandler,
		USART1_IRQHandler,
		USART2_IRQHandler,
		USART3_IRQHandler,
		EXTI15_10_IRQHandler,
		RTC_Alarm_IRQHandler,
		USBWakeUp_IRQHandler,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		BootRAM
};





